spec/cassettes/Create_payment_on_successful_charge/creates_the_payment_associated_with_the_user.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_16oCHmA85nYsHkIKmb9FGGbI
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.27.0
      Authorization:
      - Bearer sk_test_z3jvrvHHBMQ1Qf1zbhjjpA35
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.27.0","lang":"ruby","lang_version":"2.0.0 p643 (2015-02-25)","platform":"x86_64-darwin14.1.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Kevins-iMac 14.3.0 Darwin Kernel Version 14.3.0: Mon Mar 23 11:59:05 PDT 2015;
        root:xnu-2782.20.48~5/RELEASE_X86_64 x86_64","hostname":"Kevins-iMac"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 Sep 2015 13:37:52 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1978'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - '*'
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_72I1bFRUhP4iH5
      Stripe-Version:
      - '2015-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_16oCHmA85nYsHkIKmb9FGGbI",
          "created": 1443011026,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_16oCHmA85nYsHkIKTK0PV3tl",
              "object": "charge",
              "created": 1443011026,
              "livemode": false,
              "paid": true,
              "status": "succeeded",
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "source": {
                "id": "card_16oCHkA85nYsHkIK9a41Skk5",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 9,
                "exp_year": 2017,
                "fingerprint": "o7wSBIKyXzvPqrYc",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "tokenization_method": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_72GplbEAQZw8fa"
              },
              "captured": true,
              "balance_transaction": "txn_16oCHmA85nYsHkIKCri1QyT4",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_72GplbEAQZw8fa",
              "invoice": "in_16oCHmA85nYsHkIK34Pvde5X",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_descriptor": null,
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "destination": null,
              "application_fee": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_16oCHmA85nYsHkIKTK0PV3tl/refunds",
                "data": []
              }
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "req_72GpUy503BsKdO",
          "api_version": "2015-09-08"
        }
    http_version: 
  recorded_at: Wed, 23 Sep 2015 13:37:52 GMT
recorded_with: VCR 2.9.3
